//-----------------------------------------------------------------
// 程序描述:
//     ADS8688实验
// 作    者: 凌智电子
// 开始日期: 2022-06-27
// 完成日期: 2022-06-27
// 修改日期: 
// 当前版本: V1.0
// 历史版本:
//  - V1.0: (2022-06-27)	ADS8688实验
// 调试工具: 凌智STM32H750核心板、LZE_ST_LINK2、4.3寸/2.8寸 TFT液晶屏、ADS8688模块
// 说    明: 硬件连接
//						STM32H750VBT6						ADS8688模块
//								+5V		<----------->		+5V
//								GND		<----------->		GND
//								PB15	<----------->		SDI
//								PB8		<----------->		RST
//								PB9		<----------->		DAISY
//								PB14	<----------->		SDO
//								PB13	<----------->		SCLK
//								PB12	<----------->		CS
//    
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// 头文件包含
//-----------------------------------------------------------------
#include "system.h"
#include "delay.h"
#include "lcd.h"
#include "led.h"
#include "usart.h"
#include "ads8688.h"
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
int main(void)
{
	uint16_t adc_data[8];
	uint8_t dis_buf[40], i;
//	CPU_CACHE_Enable();			// 启用CPU缓存
  HAL_Init();          		// 初始化HAL库
	MPU_Memory_Protection();// 设置保护区域
	SystemClock_Config(); 	// 设置系统时钟,400Mhz  
	SysTick_clkconfig(400);	// SysTick参数配置
	LED_Init();           	// 初始化LED 
	uart_init(115200);			// 初始化串口
	LCD_Init();           	// LCD初始化
	ADS8688_Init();					// 初始化ADS8688
	POINT_COLOR=RED; 				// 笔画颜色
	LCD_ShowString(30,0,200,16,16,"STM32H750 Core Board");	
	LCD_ShowString(30,20,200,16,16,"ADS8688 TEST");	
	LCD_ShowString(30,40,200,16,16,"LZ Electronic");
	POINT_COLOR=BLUE;// 设置字体为蓝色   
	LCD_ShowString(30,60 ,200,16,16,"CH0:    0.0000V");	//先在固定位置显示小数点  
	LCD_ShowString(30,80 ,200,16,16,"CH1:    0.0000V");	//先在固定位置显示小数点  
	LCD_ShowString(30,100,200,16,16,"CH2:    0.0000V");	//先在固定位置显示小数点  
	LCD_ShowString(30,120,200,16,16,"CH3:    0.0000V");	//先在固定位置显示小数点 
	LCD_ShowString(30,140,200,16,16,"CH4:    0.0000V");	//先在固定位置显示小数点 
	LCD_ShowString(30,160,200,16,16,"CH5:    0.0000V");	//先在固定位置显示小数点 
	LCD_ShowString(30,180,200,16,16,"CH6:    0.0000V");	//先在固定位置显示小数点 
	LCD_ShowString(30,200,200,16,16,"CH7:    0.0000V");	//先在固定位置显示小数点 
	while(1)
	{
		Get_AUTO_RST_Mode_ADC_Data(8, adc_data);
		for(i=0; i < 8; i++)
		{
			sprintf ((char *)dis_buf,"CH%1d: %8.4lfmV  D: %4X    ", i, ((double)adc_data[i]-32768)*10240.0/65536, (uint16_t)adc_data[i]);
			LCD_ShowString(30,60+i*20,300,16,16,(char *)dis_buf);	//先在固定位置显示小数点 
			printf("%s\r\n", (char *)dis_buf);
		}
		printf("\r\n");
	  delay_ms(500);
	}
}

//-----------------------------------------------------------------
// End Of File
//----------------------------------------------------------------- 
