//-----------------------------------------------------------------
// 程序描述:
// 		 SPI驱动程序头文件
// 作    者: 凌智电子
// 开始日期: 2020-11-11
// 完成日期: 2020-11-11
// 修改日期: 
// 当前版本: V1.0
// 历史版本:
//  - V1.0: (2020-11-11)SPI初始化，SPI通信
// 调试工具: 凌智STM32H750核心板、LZE_ST_LINK2
// 说    明: 
//    
//-----------------------------------------------------------------
#ifndef __SPI_H
#define __SPI_H
#include "system.h"

extern SPI_HandleTypeDef SPI_Handler;  // SPI句柄

//-----------------------------------------------------------------
// 外部函数声明
//-----------------------------------------------------------------
void SPI2_Init(void);			 									// 初始化SPI口 
uint8_t SPI2_ReadWriteByte(uint8_t TxData);	// SPI读写
 
#endif
//-----------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------
