//-----------------------------------------------------------------
// spi驱动头文件
// 头文件名: spi.h
// 作    者: 凌智电子
// 开始日期: 2014-01-28
// 完成日期: 2014-01-28
// 修改日期: 2014-02-16
// 当前版本: V1.0.1
// 历史版本:
//   - V1.0: (2014-02-07)spi配置
//-----------------------------------------------------------------
#ifndef __SPI_H
#define __SPI_H
#include "stm32f10x_spi.h"
#include <stdio.h>
#include <stdint.h>

//-----------------------------------------------------------------
// 外部函数声明
//-----------------------------------------------------------------    													  
void SPI2_Init(void);
void SPI2_SetSpeed(uint8_t SPI_BaudRatePrescaler);
uint8_t SPI2_ReadWriteByte(uint8_t TxData);
uint8_t SPI2_WriteByte(uint8_t TxData);
uint8_t SPI2_ReadByte(void);
		 
#endif
//-----------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------
